using System;
using System.Collections.Generic;
using System.Linq;
using System.Linq.Expressions;
using System.Net.NetworkInformation;
using System.Text;
using System.Threading.Tasks;


namespace ConsoleApp2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //4. Дан диаметр окружности d. Найти ее длину L = π·d. В качестве значения π использовать 3.14.
            //double pi = 3.14;
            //double d;
            //Console.WriteLine("Введите диаметр окружности:");
            //string tmp = Console.ReadLine();
            //d = double.Parse(tmp);
            //Console.WriteLine("L = " + (pi * d));
            //Console.ReadKey();

            //6. Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c).
            //double a;
            //double b;
            //double c;
            //Console.WriteLine("Введите длину стороны a: ");
            //string tmp = Console.ReadLine();
            //a = double.Parse(tmp);
            //Console.WriteLine("Введите длину стороны b: ");
            //string tmk = Console.ReadLine();
            //b = double.Parse(tmk);
            //Console.WriteLine("Введите длину стороны c: ");
            //string tmb = Console.ReadLine();
            //c = double.Parse(tmb);
            //Console.WriteLine("V = " + (a * b * c));
            //Console.WriteLine("S = " + (2 * (a * b + b * c + a * c)));
            //Console.ReadKey();

            //9. Даны два неотрицательных числа a и b.Найти их среднее геометрическое, то есть квадратный корень из их произведения: a ⋅b.
            //double a;
            //double b;
            //Console.WriteLine("Введите число a: ");
            //string tmp = Console.ReadLine();
            //a = double.Parse(tmp);
            //Console.WriteLine("Введите число b: ");
            //string tmk = Console.ReadLine();
            //b = double.Parse(tmk);
            //if (a >= 0 && b >= 0)
            //{
            //    Console.WriteLine("Среднее геометрическое равно = " + Math.Sqrt(a * b));
            //} else
            //{
            //    Console.WriteLine("Введите нетрицательные числа");
            //}
            //Console.ReadKey();


            //10.Даны два ненулевых числа.Найти сумму, разность, произведение и частное их квадратов.
            //double a;
            //double b;
            //Console.WriteLine("Введите первое число: ");
            //string tmp = Console.ReadLine();
            //a = double.Parse(tmp);
            //Console.WriteLine("Введите второе число: ");
            //string tmk = Console.ReadLine();
            //b = double.Parse(tmk);
            //if (a != 0 && b != 0)
            //{
            //    Console.WriteLine("Сумма = " + (a + b));
            //    Console.WriteLine("Разность = " + (a - b));
            //    Console.WriteLine("Произведенгие = " + (a * b));
            //    Console.WriteLine("Частность = " + (a / b));
            //}
            //else
            //{
            //    Console.WriteLine("Введите ненулевые значения");
            //}
            //Console.ReadKey();

            //3. Дан размер файла в байтах.Используя операцию деления нацело, найти количество полных килобайтов, которые занимает данный файл (1 килобайт = 1024 байта).
            //int a;
            //int b = 1024;
            //Console.WriteLine("Введите размер файла в байтах: ");
            //string tmp = Console.ReadLine();
            //a = int.Parse(tmp);
            //Console.WriteLine("Размер файла в килобайтах: " + (a / b));
            //Console.ReadKey();


        }
    }
}



